3_urban/1_models/openfoam/0.orig/alphat
/*--------------------------------*- C++ -*----------------------------------*\
|       o          |                                                          |
|    o     o       | HELYX-OS                                                  |
|   o   O   o      | Version: v2.4.0                                           |
|    o     o       | Web:     http://www.engys.com                            |
|       o          |                                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    location "0";
    object alphat;
}
dimensions [ 0 2 -1 0 0 0 0 ];
internalField uniform 0.0;
boundaryField
{

    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"
    
    merged_domain_ground
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_inlet
    {
        type zeroGradient;
    }

    merged_outlet
    {
        type zeroGradient;
    }

    merged_domain
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_water
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_ground
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_building3
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_building2
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

    merged_building1
    {
        type alphatJayatillekeWallFunction;
        Prt 0.85;
        value uniform 0.0;
    }

}
